## 4.6 Merging and exporting data

### This script contains the following points:

#### 1. Create data to experiment on
#### 2. Concatenate dataframes
#### 3. Append data
#### 4. Merge data

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [11]:
bams = {'Age': [30, 40, 50],
        'Name': ['Bamidele', 'Wunmi', 'Selmot']}

In [13]:
bams

{'Age': [30, 40, 50], 'Name': ['Bamidele', 'Wunmi', 'Selmot']}

In [17]:
bams_df = pd.DataFrame(bams, index = [0, 1, 2])

In [19]:
bams_df

   Age      Name
0   30  Bamidele
1   40     Wunmi
2   50    Selmot

#### 1. Create data to experiment on

In [21]:
# Define a dictionary containing January 2020 data 

data1 = {'customer_id': ['6732', '767', '890', '635'], 
        'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'], 
        'purchased_meat':[0, 13, 3, 4], 
        'purchased_alcohol': [1, 2, 10, 0],
        'purchased_snacks': [10, 5, 1, 7]    }

In [23]:
# Define a dictionary containing February 2020 data 

data2 = {'customer_id':['6732', '767', '890', '635'], 
        'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'], 
        'purchased_meat':[0, 10, 5, 3], 
        'purchased_alcohol':[2, 4, 14, 0],
        'purchased_snacks': [15, 3, 2, 6]}

In [25]:
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])

df_1 = pd.DataFrame(data2,index=[0, 1, 2, 3])

In [27]:
df

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [29]:
df_1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

#### 2. Concatenate dataframes

In [32]:
# Create a list that contains our dataframes

frames = [df, df_1]

In [34]:
# Check the output

frames

[  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Jan-20               0                  1                10
 1         767  Jan-20              13                  2                 5
 2         890  Jan-20               3                 10                 1
 3         635  Jan-20               4                  0                 7,
   customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
 0        6732  Feb-20               0                  2                15
 1         767  Feb-20              10                  4                 3
 2         890  Feb-20               5                 14                 2
 3         635  Feb-20               3                  0                 6]

In [64]:
bams_concat2 = pd.concat( [df, df_1] )

In [66]:
bams_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [48]:
# Check the data types to be sure it is a list

type(frames)

list

In [52]:
# Concatenate the dataframes using default options

df_concat = pd.concat(frames)

In [54]:
# Check the output

df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [58]:
# Concatenate the dataframes using the axis = 1 --> create a wide format as an output

df_concat = pd.concat(frames, axis = 1)

In [60]:
# Check the output

df_concat

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks
0,6732,Jan-20,0,1,10,6732,Feb-20,0,2,15
1,767,Jan-20,13,2,5,767,Feb-20,10,4,3
2,890,Jan-20,3,10,1,890,Feb-20,5,14,2
3,635,Jan-20,4,0,7,635,Feb-20,3,0,6

In [70]:
df.join()


df.merge()

In [ ]:
df.

#### 3. Append data

In [80]:
# bams_append = df.append(df_1)

In [78]:
# df_appended = df.append(df_1)

In [76]:
# df_appended

In [82]:
# Create data with different columns from df

data3 = {'customer_id':['6732', '767', '890', '635'], 
        'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'], 
        'days_purchased_on':[0, 13, 3, 4]}

In [84]:
# Convert to dataframe

df_2 = pd.DataFrame(data3,index=[0, 1, 2, 3])

In [86]:
df_2

  customer_id   month  days_purchased_on
0        6732  Jan-20                  0
1         767  Jan-20                 13
2         890  Jan-20                  3
3         635  Jan-20                  4

In [94]:
# Create a new dataset combining df and df_2

# df_append_test = df.append(df_2)

In [92]:
# df_append_test
cust_id

#### 4. Merge data

In [98]:
bams_merge = df.merge( df,  on = 'customer_id' )

In [100]:
bams_merge

,customer_id,month_x,purchased_meat_x,purchased_alcohol_x,purchased_snacks_x,month_y,purchased_meat_y,purchased_alcohol_y,purchased_snacks_y
0,6732,Jan-20,0,1,10,Jan-20,0,1,10
1,767,Jan-20,13,2,5,Jan-20,13,2,5
2,890,Jan-20,3,10,1,Jan-20,3,10,1
3,635,Jan-20,4,0,7,Jan-20,4,0,7

In [102]:
bams_merge2 = df.merge(df, on = ['customer_id' , 'month']  )

In [104]:
bams_merge2

,customer_id,month,purchased_meat_x,purchased_alcohol_x,purchased_snacks_x,purchased_meat_y,purchased_alcohol_y,purchased_snacks_y
0,6732,Jan-20,0,1,10,0,1,10
1,767,Jan-20,13,2,5,13,2,5
2,890,Jan-20,3,10,1,3,10,1
3,635,Jan-20,4,0,7,4,0,7

In [96]:
print(df)
print(df_1)
print(df_2)

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6
  customer_id   month  days_purchased_on
0        6732  Jan-20                  0
1         767  Jan-20                 13
2         890  Jan-20                  3
3         635  Jan-20                  4

In [114]:
df_2

  customer_id   month  days_purchased_on
0        6732  Jan-20                  0
1         767  Jan-20                 13
2         890  Jan-20                  3
3         635  Jan-20                  4

In [116]:
df

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [106]:
# Merge df and df_2 using customer_id as a key 

df_merged = df.merge(df_2, on = ['customer_id'])

In [118]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on
0,6732,Jan-20,0,1,10,0
1,767,Jan-20,13,2,5,13
2,890,Jan-20,3,10,1,3
3,635,Jan-20,4,0,7,4

In [124]:
# Merge df and df_2 using customer_id and month as a keys 

df_merged = df.merge(df_2, on = ['customer_id', 'month'])

In [126]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on
0,6732,Jan-20,0,1,10,0
1,767,Jan-20,13,2,5,13
2,890,Jan-20,3,10,1,3
3,635,Jan-20,4,0,7,4

In [128]:
# Merge df and df_2 using customer_id and month as a keys, add a merge flag

df_merged = df.merge(df_2, on = ['customer_id', 'month'], indicator = True)

In [130]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,13,both
2,890,Jan-20,3,10,1,3,both
3,635,Jan-20,4,0,7,4,both

In [132]:
df_merged['_merge'].value_counts()

_merge
both          4
left_only     0
right_only    0
Name: count, dtype: int64

In [134]:
df_merged['_merge'].value_counts()

_merge
both          4
left_only     0
right_only    0
Name: count, dtype: int64

In [142]:
# Test merge without overwriting

pd.merge(df,df_2, on = ['customer_id', 'month'], how = 'outer', indicator = True)

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,635,Jan-20,4,0,7,4,both
1,6732,Jan-20,0,1,10,0,both
2,767,Jan-20,13,2,5,13,both
3,890,Jan-20,3,10,1,3,both

In [3]:
folderpath = r'C:\Users\Bamidele\Desktop\Training_content\Data Analytics Training - Techbams Solutions\Python\BasketAnalysis_python_project'

In [5]:
df_ords_prior = pd.read_csv( os.path.join(folderpath, '02 Data', 'Raw Data', 'orders_products_prior.csv'), index_col = False)

In [6]:
# check the output
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [9]:
# check the shape or dimension of the data
df_ords_prior.shape

(32434489, 4)

In [11]:
df_ords = pd.read_csv( os.path.join(folderpath, '02 Data', 'Cleaned Data', 'orders_wrangled.csv'))

In [13]:
df_ords.shape

(3421083, 7)

In [15]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [17]:
# Merge the two dataframe
df_merge_large = df_ords.merge( df_ords_prior,   on = 'order_id',  indicator = True)

In [18]:
# Ccheck the data
df_merge_large.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [21]:
df_merge_large['_merge']. value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

- There are 32 million plus rows of data now

In [36]:
df_merge_large.drop(columns = ['Unnamed: 0'] , inplace=True )

In [26]:
df_merge_large2 = df_ords.merge( df_ords_prior, how = 'outer',  on = 'order_id',   indicator = True)

In [28]:
df_merge_large2['_merge']. value_counts()

_merge
both          32434489
left_only       206209
right_only           0
Name: count, dtype: int64

#### Exporting data in pickle format

.csv; pdf, 

pickle = .pkl

In [40]:
# export to pickle file
df_merge_large.to_pickle(os.path.join( folderpath, '02 Data', 'Cleaned Data', 'orders_products_combined.pkl') )

In [42]:
bams_test_pickle = pd.read_pickle( os.path.join(folderpath, '02 Data', 'Cleaned Data', 'orders_products_combined.pkl'))

In [44]:
bams_test_pickle.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [46]:
bams_test_pickle.shape

(32434489, 10)